test/good/prefer-augmented-assign.cfg.dot
digraph "prefer-augmented-assign" {
    node [shape=box];
    subgraph "cluster_Test__test" {
        label="Test__test";
        "Test__test_68" [label="let a: Int = 42"];
        "Test__test_69" [label="a = a + 1"];
        "Test__test_70" [label="a = 1 + a"];
        "Test__test_71" [label="self.field = 1 + self.field"];
        "Test__test_72" [label="self.field = self.field + a"];
        "Test__test_73" [label="self.field = self.field + a + 1"];
        "Test__test_74" [label="self.field = -self.field + a",style=filled,fillcolor="#66A7DB"];
        "Test__test_68" -> "Test__test_69";
        "Test__test_69" -> "Test__test_70";
        "Test__test_70" -> "Test__test_71";
        "Test__test_71" -> "Test__test_72";
        "Test__test_72" -> "Test__test_73";
        "Test__test_73" -> "Test__test_74";
    }
}
